#include <stdio.h>
#include <string.h>

int main(void)
{
    char name[21];

    scanf("%s", name);
    
    printf("\"%s\"\n", name);
    printf("\"%20s\"\n", name);
    printf("\"%-20s\"\n", name);
    printf("\"%s\"\n", name);

    return 0;
}

/*Неопнятное условие, по выподу тестовых данных в четвёртой строке свободная от слов часть должна быть длиной в 5 символов,
либо с каждой стороны по 5 символов, но в итоге длина строки в ковычках соответствует самой строке + свободное пространство,
соответствующее длине строки + 5, поделённое на две стороны относительно слова, что некорректно, ведь в случае чётного 
количества символов в строке в итоге пространства получатся неравными*/