#include <stdio.h>

int main(void)
{
    int dec = 10, oct = 010, hex = 0x10;
    printf("DEC_10: %d\nOCT_10: %d\nHEX_10: %d\n", dec, oct, hex);

    printf("INT_SUFFIX: %d %d %d %d\n", sizeof(10), sizeof(10u), sizeof(10LL), sizeof(10ULL));
    
    printf("FLOAT_SUFFIX: %d %d %d\n", sizeof(0.1f), sizeof(0.1), sizeof(0.1L));
    printf("FLOAT_EQ: %d\n", 0.1 == 0.1f);

    char c = 'A';
    printf("CHAR_FORMS: %d %d %d\n", 'A', '\x41', '\101');
    printf("CHAR_LIT_VAR_STR: %d %d %d\n", sizeof('A'), sizeof(c), sizeof("A"));

    return 0;
}

// В десятичной системе "десяткой" является число 10, в восьмеричной системе "десяткой" является число 8, в шестнадцатеричной системе "десяткой" является число 16.
// Суффиксы u, LL, ULL, f, L (в данном случае LF) указывают тип литерала, что позволяет компилятору корректно выделить память (и интерпретировать значение).
// 0.1f не равно 0.1, так как при неявной типизации литералам вида 0.1 присваивается тип double, который имееет другой размер резервируемой памяти, что ведёт к неравенству к контексте компьютера
// изначально все одиночные символы в C представленны типом int, а именно кода этого символа в кодировке ASCII и только затем (при присвоении) конвертируется в тип char 